src/cf/Catalogs/Файлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>Файлы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/ПолнотекстныйПоиск/Ext/Module.bsl
Процедура ИзвлечьСодержаниеФайла() Экспорт
	Выборка = Справочники.Файлы.Выбрать(,,Новый Структура("Изменен", Истина));
	
	Пока Выборка.Следующий() Цикл
		Файл = Выборка.ПолучитьОбъект();
		Файл.Изменен = Ложь;
		
		Если Не Истина Тогда
			Файл.Записать();
			Продолжить;
		КонецЕсли;
		
		ЧтениеДанных = Новый ЧтениеДанных(Файл.Файл.Получить());
		Файл.Содержание = ЧтениеДанных.ПрочитатьСимволы();
		Файл.Записать();
	КонецЦикла;
КонецПроцедуры
